<template>
  <div class="text-center pt-5 pb-4">
    <a href="#">
      <img src="@/assets/images/logo_32_blue.svg" width="64" height="64" alt="">
    </a>
  </div>
  <div class="container-fluid col-8">
    <main>
      <div class="form-header">
        <h4>
          <b>약관 동의</b>
        </h4>
      </div>
      <div class="form mt-4 p-4">
        <form class>
          <div class="form-group mb-4">
            <label class="el-checkbox">
              <input type="checkbox" class="checkbox-inner" v-model="selectall" name="check" v-on:click="selectAll(this)" />
              <!--<label for="checkbox">{{ checked }}</label>-->
              <label for="exampleInputEmail1">이용약관, 개인정보 수집 및 이용에 모두 동의합니다.</label>
            </label>
            <section class="group">
              <h6><b>이용약관</b></h6>
              <div class="group-scroll">
                <h6>제 1 장 총칙</h6>

                <h6>제 1 조 (목적)</h6>
                <p>본 약관은 온라인 출타장병현황 인앤아웃(이하 "조직"라 합니다)이 운영하는 제반 서비스의 이용조건 및 절차에 관한 사항 및 기타 필요한 사항을 규정함을 목적으로 한다.</p>

                <h6>제 2 조 (용어의 정의)</h6>
                <p>본 약관에서 사용하는 용어는 다음과 같이 정의한다.</p>
                <p>①회원 : 기본 회원 정보를 입력하였고, 조직과 서비스 이용계약을 체결하여 아이디를 부여받은 개인</p>
                <p>②아이디(ID) : 회원식별과 회원의 서비스 이용을 위해 회원이 선정하고 조직이 승인하는 문자와 숫자의 조합</p>
                <p>③비밀번호(Password) : 회원이 통신상의 자신의 비밀을 보호하기 위해 선정한 문자와 숫자의 조합</p>
                <p>④해지 : 조직 또는 회원에 의한 이용계약의 종료</p>


                <h6>제 3 조 (약관의 공시 및 효력과 변경)</h6>
                <p>①본 약관은 회원가입 화면에 게시하여 공시하며 조직은 사정변경 및 영업상 중요한 사유가 있을 경우 약관을 변경할 수 있으며 변경된 약관은 공지사항을 통해 공시한다</p>
                <p>②본 약관 및 차후 조직사정에 따라 변경된 약관은 이용자에게 공시함으로써 효력을 발생한다.</p>

                <h6>제 4 조 (약관 외 준칙)</h6>
                <p>본 약관에 명시되지 않은 사항이 전기통신기본법, 전기통신사업법, 정보통신촉진법, ‘전자상거래등에서의 소비자 보호에 관한 법률’, ‘약관의 규제에관한법률’, ‘전자거래기본법’,
                  ‘전자서명법’, ‘정보통신망 이용촉진등에 관한 법률’, ‘소비자보호법’ 등 기타 관계 법령에 규정되어 있을 경우에는 그 규정을 따르도록 한다.</p>

                <h6>제 2 장 이용계약</h6>

                <h6>제 5 조 (이용신청)</h6>
                <p>①이용신청자가 회원가입 안내에서 본 약관과 개인정보보호정책에 동의하고 등록절차(조직의 소정 양식의 가입 신청서 작성)를 거쳐 '확인' 버튼을 누르면 이용신청을 할 수 있다.</p>
                <p>②이용신청자는 반드시 실명과 실제 정보를 사용해야 하며 1개의 생년월일에 대하여 1건의 이용신청을 할 수 있다.</p>
                <p>③실명이나 실제 정보를 입력하지 않은 이용자는 법적인 보호를 받을 수 없으며, 서비스 이용에 제한을 받을 수 있다.</p>

                <h6>제 6 조 (이용신청의 승낙)</h6>
                <p>①조직는 제5조에 따른 이용신청자에 대하여 제2항 및 제3항의 경우를 예외로 하여 서비스 이용을 승낙한다.</p>
                <p>②조직은 아래 사항에 해당하는 경우에 그 제한사유가 해소될 때까지 승낙을 유보할 수 있다.</p>
                <p>가. 서비스 관련 설비에 여유가 없는 경우</p>
                <p>나. 기술상 지장이 있는 경우</p>
                <p>다. 기타 조직 사정상 필요하다고 인정되는 경우</p>
                <p>③조직은 아래 사항에 해당하는 경우에 승낙을 하지 않을 수 있다.</p>
                <p>가. 다른 사람의 명의를 사용하여 신청한 경우</p>
                <p>나. 이용자 정보를 허위로 기재하여 신청한 경우</p>
                <p>다. 사회의 안녕질서 또는 미풍양속을 저해할 목적으로 신청한 경우</p>
                <p>라. 기타 조직이 정한 이용신청 요건이 미비한 경우</p>


                <h6>제 3 장 계약 당사자의 의무</h6>

                <h6>제 7 조 (조직의 의무)</h6>
                <p>①조직은 사이트를 안정적이고 지속적으로 운영할 의무가 있다.</p>
                <p>②조직은 이용자로부터 제기되는 의견이나 불만이 정당하다고 인정될 경우에는 즉시 처리해야 한다. 단, 즉시 처리가 곤란한 경우에는 이용자에게 그 사유와 처리일정을 공지사항 또는
                  전자우편을 통해 통보해야 한다.</p>
                <p>③제1항의 경우 수사상의 목적으로 관계기관 및 정보통신윤리위원회의 요청이 있거나 영장 제시가 있는 경우, 기타 관계 법령에 의한 경우는 예외로 한다.</p>

                <h6>제 8 조 (이용자의 의무)</h6>
                <p>①이용자는 본 약관 및 조직의 공지사항, 사이트 이용안내 등을 숙지하고 준수해야 하며 기타 조직의 업무에 방해되는 행위를 해서는 안된다.</p>
                <p>②이용자는 조직의 사전 승인 없이 본 사이트를 이용해 어떠한 영리행위도 할 수 없다.</p>
                <p>③이용자는 본 사이트를 통해 얻는 정보를 조직의 사전 승낙 없이 복사, 복제, 변경, 번역, 출판, 방송 및 기타의 방법으로 사용하거나 이를 타인에게 제공할 수 없다.</p>


                <h6>제 4 장 서비스의 제공 및 이용</h6>

                <h6>제 9 조 (서비스 이용)</h6>
                <p>①이용자는 본 약관의 규정된 사항을 준수해 사이트를 이용한다.</p>
                <p>②조직이 제공하는 서비스는 다음과 같다.</p>
                <p>출타현황 등록 및 조회</p>
                <p>마일리지/상점 등록 및 조회</p>
                <p>③본 약관에 명시되지 않은 서비스 이용에 관한 사항은 조직이 정해 '공지사항'에 게시하거나 또는 별도로 공지하는 내용에 따른다.</p>


                <h6>제 10 조 (정보의 제공)</h6>
                <p>조직은 회원이 서비스 이용 중 필요하다고 인정되는 다양한 정보에 대하여 전자메일이나 서신우편 등의 방법으로 회원에게 정보를 제공할 수 있다.</p>

                <h6>제 11 조 (광고게재)</h6>
                <p>①조직은 서비스의 운용과 관련하여 서비스 화면, 홈페이지, 전자우편 등에 광고 등을 게재할 수 있다.</p>
                <p>②조직은 사이트에 게재되어 있는 광고주의 판촉활동에 회원이 참여하거나 교신 또는 거래의 결과로서 발생하는 모든 손실 또는 손해에 대해 책임을 지지 않는다.</p>

                <h6>제 12 조 (서비스 이용의 제한)</h6>
                <p>본 사이트 이용 및 행위가 다음 각 항에 해당하는 경우 조직은 해당 이용자의 이용을 제한할 수 있다.</p>
                <p>①공공질서 및 미풍양속, 기타 사회질서를 해하는 경우</p>
                <p>②범죄행위를 목적으로 하거나 기타 범죄행위와 관련된다고 객관적으로 인정되는 경우</p>
                <p>③타인의 명예를 손상시키거나 타인의 서비스 이용을 현저히 저해하는 경우</p>
                <p>④타인의 의사에 반하는 내용이나 광고성 정보 등을 지속적으로 전송하는 경우</p>
                <p>⑤해킹 및 컴퓨터 바이러스 유포 등으로 서비스의 건전한 운영을 저해하는 경우</p>
                <p>⑥다른 이용자 또는 제3자의 지적재산권을 침해하거나 지적재산권자가 지적 재산권의 침해를 주장할 수 있다고 판단되는 경우</p>
                <p>⑦타인의 아이디 및 비밀번호를 도용한 경우</p>
                <p>⑧기타 관계 법령에 위배되는 경우 및 조직이 이용자로서 부적당하다고 판단한 경우</p>

                <h6>제 13 조 (서비스 제공의 중지)</h6>
                <p>조직은 다음 각 호에 해당하는 경우 서비스의 전부 또는 일부의 제공을 중지할 수 있다.</p>
                <p>①전기통신사업법 상에 규정된 기간통신 사업자 또는 인터넷 망 사업자가 서비스를 중지했을 경우</p>
                <p>②정전으로 서비스 제공이 불가능할 경우</p>
                <p>③설비의 이전, 보수 또는 공사로 인해 부득이한 경우</p>
                <p>④서비스 설비의 장애 또는 서비스 이용의 폭주 등으로 정상적인 서비스 제공이 어려운 경우</p>
                <p>⑤전시, 사변, 천재지변 또는 이에 준하는 국가비상사태가 발생하거나 발생할 우려가 있는 경우</p>

                <h6>제 14 조 (게시물 관리)</h6>
                <p>조직은 건전한 통신문화 정착과 효율적인 사이트 운영을 위하여 이용자가 게시하거나 제공하는 자료가 제12조에 해당한다고 판단되는 경우에 임의로 삭제, 자료이동, 등록거부를 할 수
                  있다.</p>

                <h6>제 15 조 (서비스 이용 책임)</h6>
                <p>이용자는 조직에서 권한 있는 사원이 서명한 명시적인 서면에 구체적으로 허용한 경우를 제외하고는 서비스를 이용하여 불법상품을 판매하는 영업활동을 할 수 없으며 특히 해킹, 돈벌기
                  광고, 음란 사이트를 통한 상업행위, 상용 S/W 불법제공 등을 할 수 없다. 이를 어기고 발생한 영업활동의 결과 및 손실, 관계기관에 의한 구속 등 법적 조치 등에 관해서는 조직이
                  책임을 지지 않는다.</p>


                <h6>제 5 장 기타</h6>

                <h6>제 16 조 (면책 및 손해배상)</h6>
                <p>①천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 조직의 서비스 제공 책임이 면제된다.</p>
                <p>②조직은 이용자간 또는 이용자와 제3자간의 상호거래 관계에서 발생되는 결과에 대하여 어떠한 책임도 부담하지 않는다.</p>
                <p>③조직은 이용자가 게시판에 게재한 정보, 자료, 내용 등에 관하여 사실의 정확성, 신뢰도 등에 어떠한 책임도 부담하지 않으며 이용자는 본인의 책임 아래 본 사이트를 이용해야 한다.
                </p>
                <p>④이용자가 게시 또는 전송한 자료 등에 관하여 손해가 발생하거나 자료의 취사선택, 기타 무료로 제공되는 서비스 이용과 관련해 어떠한 불이익이 발생하더라도 이에 대한 모든 책임은
                  이용자에게 있다.</p>
                <p>⑤아이디와 비밀번호의 관리 및 이용자의 부주의로 인하여 발생되는 손해 또는 제3자에 의한 부정사용 등에 대한 책임은 이용자에게 있다.</p>
                <p>⑥이용자가 본 약관의 규정을 위반함으로써 조직에 손해가 발생하는 경우 이 약관을 위반한 이용자는 조직에 발생한 모든 손해를 배상해야 하며 동 손해로부터 조직을 면책시켜야 한다.
                </p>

                <h6>제 17 조 (개인신용정보 제공 및 활용에 대한 동의서)</h6>
                <p>조직이 회원 가입과 관련해 취득한 개인 신용 정보는 신용정보의 이용 및 보호에 관한 법률 제23조의 규정에 따라 타인에게 제공 및 활용 시 이용자의 동의를 얻어야 한다. 이용자의
                  동의는 조직이 회원으로 가입한 이용자의 신용정보를 신용정보기관, 신용정보업자 및 기타 이용자 등에게 제공해 이용자의 신용을 판단하기 위한 자료로서 활용하거나 공공기관에서 정책자료로
                  활용하는데 동의하는 것으로 간주한다.</p>

                <h6>제 18 조 (분쟁의 해결)</h6>
                <p>①조직과 이용자는 본 사이트 이용과 관련해 발생한 분쟁을 원만하게 해결하기 위하여 필요한 모든 노력을 해야 한다.</p>
                <p>②제1항의 규정에도 불구하고 동 분쟁으로 인하여 소송이 제기될 경우 동 소송은 조직의 본사 소재지를 관할하는 법원의 관할로 본다.</p>

                <h6>부칙</h6>
                <p>본 약관은 2022년 10월 18일부터 적용한다.</p>
              </div>
              <input type="checkbox" class="checkbox-inner" v-model="first_agree" true-value="agree" false-value="disagree" name="check"  />
              <!--<label for="checkbox">{{ checked }}</label>-->
              <label for="exampleInputEmail1">이용약관에 모두 동의합니다.</label>
            </section>
            <span class="text-muted"></span>
            <section class="group mt-4">
              <h6><b>개인정보 수집 및 이용에 대한 안내</b></h6>
              <div class="group-scroll">
                <p>정보통신망법 규정에 따라 온라인 장병출타현황 IN&OUT에 회원가입 신청하시는 분께 수집하는 개인정보의 항목, 개인정보의 수집 및 이용목적, 개인정보의 보유 및 이용기간을 안내 드리오니 자세히 읽은 후 동의하여 주시기 바랍니다.</p>
                <h6>1. 수집하는 개인정보 항목 및 수집방법</h6>
                <p>수집항목 : </p>
                  <p>첫째, 조직은 회원가입, 상담, 서비스 신청 등을 위해 아래와 같은 최소한의 개인정보를 수집하고 있습니다.</p>
                  <p>필수항목 : 성명, 로그인ID, 회원분류정보, 계급/등급 정보, 생년월일, 성별, 비밀번호, 이메일, 쿠키, </p> 
                  <p>선택항목 : 휴대폰 번호</p>
                  <p>둘째, 서비스 이용과정이나 사업처리 과정에서 아래와 같은 정보들이 자동으로 생성되어 수집될 수 있습니다.</p>
                  <p>* IP Address, 쿠키, 방문 일시, 서비스 이용 기록, 불량 이용 기록</p>
                  <p>셋째, 부가 서비스 및 또는 이벤트 응모 과정에서 해당 서비스의 이용자에 한해서 아래와 같은 정보들이 수집될 수 있습니다. 해당 서비스의 이용자에 한해서만 개인정보 추가 수집이 발생할 수 있으며, 이러한 경우 별도의 동의를 받습니다.</p> 
                  <p>개인정보 추가 수집에 대해 동의를 받는 경우 : 휴대폰 번호(선택), 주소</p> 
                  <p>개인정보 수집방법 :</p>
                  <p>* 홈페이지, 전화, 상담 게시판, 이메일, 이벤트 응모, 배송 요청</p>
                <h6>2. 개인정보의 수집 및 이용목적</h6>
                <p>조직은 수집한 개인정보를 다음의 목적을 위해 활용합니다.</p>
                <p>서비스 제공에 관한 계약 이행 및 서비스 제공에 따른 콘텐츠 제공</p>
                <p>* 회원 관리 회원제 서비스 이용에 따른 본인확인, 개인 식별, 불량회원의 부정 이용 방지와 비인가 사용 방지, 추후 법정 대리인 본인확인, 분쟁 조정을 위한 기록보존, 불만처리 등 민원처리, 고지사항 전달</p>
                <p>* 신규 서비스 개발 및 마케팅 및 광고에 활용 이벤트 등 광고성 정보 전달</p>
                <p>신규 서비스 개발 및 맞춤 서비스 제공, 통계학적 특성에 따른 서비스 제공 및 광고 게재,서비스의 유효성 확인, 이벤트 및 광고성 정보 제공 및 참여기회 제공, 접속빈도 파악, 회원의 서비스이용에 대한 통계</p>
                <h6>3. 개인정보를 제3자에게 제공하는 경우 제공받는 자의 성명(법인인 경우에는 법인의 명칭을 말한다), 제공받는 자의 이용 목적과 제공하는 개인정보의 항목</h6>
                <p>
                    - 제공받는 자 : 국방부(MND)
                    - 제공하는 개인정보의 항목 : 이름, 이메일, 회원분류정보, 계급/등급 정보, 생년월일, 성별, 서비스 이용내역
                    - 제공받는 자의 이용 목적 : 서비스 이용내역에 대한 정보취득
                    4. 개인정보의 보유 및 이용기간
                    원칙적으로, 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다. 단, 다음의 정보에 대해서는 아래의 이유로 명시한 기간 동안 보존합니다.
                    보존 항목 : 성명, 로그인ID, 회원분류정보, 계급/등급 정보, 생년월일, 성별, 비밀번호, 휴대전화번호, 이메일, 쿠키, 컨텐츠 이용내역
                    가. 조직 내부 방침에 의한 정보보유 사유
                    - 부정이용기록
                    - 보존 이유 : 부정 이용 방지
                    - 보존 기간 : 1년
                    나. 관련법령에 의한 정보보유 사유
                    상법, 전자상거래 등에서의 소비자보호에 관한 법률 등 관계법령의 규정에 의하여 보존할 필요가 있는 경우 조직은 관계법령에서 정한 일정한 기간 동안 회원정보를 보관합니다. 이 경우 조직은 보관하는 정보를 그 보관의 목적으로만 이용하며 보존기간은 아래와 같습니다.
                    
                    보존항목: 원칙적으로, 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다. 단, 다음의 정보에 대해서는 아래의 이유로 명시한 기간 동안 보존합니다.
                    
                    보존 항목 :성명, 로그인ID, 회원분류정보, 계급/등급 정보, 생년월일, 성별, 비밀번호, 휴대전화번호, 이메일, 쿠키
                    
                    보존 근거 : 사업의 결과물, 소송이나 분쟁의 대비 등
                    
                    보존 기간 : 5년
                    
                    - 계약 또는 청약철회 등에 관한 기록
                    ·보존 이유 : 전자상거래 등에서의 소비자보호에 관한 법률
                    ·보존 기간 : 5년
                    - 대금결제 및 재화 등의 공급에 관한 기록
                    ·보존 이유 : 전자상거래 등에서의 소비자보호에 관한 법률
                    ·보존 기간 : 5년
                    - 소비자의 불만 또는 분쟁처리에 관한 기록
                    ·보존 이유 : 전자상거래 등에서의 소비자보호에 관한 법률
                    ·보존 기간 : 3년
                    - 웹사이트 방문기록
                    ·보존 이유 : 통신비밀보호법
                    ·보존 기간 : 3개월
                    5. 개인정보 파기절차 및 방법
                    이용자의 개인정보는 원칙적으로 개인정보의 수집 및 이용목적이 달성되면 지체 없이 파기합니다.
                    조직의 개인정보 파기절차 및 방법은 다음과 같습니다.
                    가. 파기절차
                    - 이용자가 회원가입 등을 위해 입력한 정보는 목적이 달성된 후 별도의 DB로 옮겨져(종이의 경우 별도의 서류함) 내부 방침 및 기타 관련 법령에 의한 정보보호 사유에 따라(보유 및 이용기간 참조)일정 기간 저장된 후 파기됩니다.
                    - 동 개인정보는 법률에 의한 경우가 아니고서는 보유되는 이외의 다른 목적으로 이용되지 않습니다.
                    나. 파기방법
                    - 종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기합니다.
                    - 전자적 파일 형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.
                    6. 이용자 및 법정대리인의 권리와 그 행사방법
                    - 이용자 및 법정 대리인은 언제든지 등록되어 있는 자신의 개인정보를 조회하거나 수정할 수 있으며 가입해지를 요청할 수도 있습니다.
                    - 이용자의 개인정보 조회, 수정을 위해서는 '개인정보변경'(또는 '회원정보수정' 등)을, 가입해지(동의철회)를 위해서는 "회원탈퇴"를 클릭하여 직접 탈퇴가 가능합니다.
                    - 혹은 개인정보관리책임자에게 서면, 전화 또는 이메일로 연락하시면 지체 없이 조치하겠습니다.
                    - 이용자가 개인정보의 오류에 대한 정정을 요청하신 경우에는 정정을 완료하기 전까지 당해 개인정보를 이용 또는 제공하지 않습니다. 또한 잘못된 개인정보를 제3 자에게 이미 제공한 경우에는 정정 처리결과를 제3자에게 지체 없이 통지하여 정정이 이루어지도록 하겠습니다.
                    - 조직은 이용자 혹은 법정 대리인의 요청에 의해 해지 또는 삭제된 개인정보는 "4. 개인정보의 보유 및 이용기간"에 명시된 바에 따라 처리하고 그 외의 용도로 열람 또는 이용할 수 없도록 처리하고 있습니다.
                    7.개인정보 자동 수집 장치의 설치/운영 및 거부에 관한 사항
                    조직은 개인화되고 맞춤화된 서비스를 제공하기 위해서 이용자의 정보를 저장하고 수시로 불러오는 '쿠키(cookie)'를 사용합니다. 쿠키는 웹사이트를 운영하는데 이용되는 서버가 이용자의 브라우저에게 보내는 아주 작은 텍스트 파일로 이용자 컴퓨터의 하드디스크에 저장됩니다.
                    가. 쿠키의 사용 목적
                    이용자들이 방문한 각 서비스와 웹 사이트에 대한 방문 및 이용형태, 보안접속 여부, 이용자 규모 등을 파악하여 이용자에게 최적화된 정보 제공을 위하여 사용합니다.
                    나. 쿠키의 설치/운영 및 거부
                    - 이용자는 쿠키 설치에 대한 선택권을 가지고 있습니다. 따라서 이용자는 웹브라우저에서 옵션을 설정함으로써 모든 쿠키를 허용하거나, 쿠키가 저장될 때마다 확인을 거치거나, 아니면 모든 쿠키의 저장을 거부할 수도 있습니다.
                    - 다만, 쿠키의 저장을 거부할 경우에는 로그인이 필요한 일부 서비스는 이용에 어려움이 있을 수 있습니다.
                    - 쿠키 설치 허용 여부를 지정하는 방법(Internet Explorer의 경우)
                    ① [도구] 메뉴에서 [인터넷 옵션]을 선택합니다.
                    ② [개인정보 탭]을 클릭합니다.
                    ③ [개인정보취급 수준]을 설정하시면 됩니다.
                    8. 개인정보의 기술적/관리적 보호 대책
                    조직은 이용자들의 개인정보를 취급함에 있어 개인정보가 분실, 도난, 누출, 변조 또는 훼손되지 않도록 안전성 확보를 위하여 다음과 같은 기술적/관리적 대책을 강구하고 있습니다.
                    가. 비밀번호 암호화
                    회원 아이디(ID)의 비밀번호는 암호화되어 저장 및 관리되고 있어 본인만이 알고 있으며, 개인정보의 확인 및 변경도 비밀번호를 알고 있는 본인에 의해서만 가능합니다.
                    나. 해킹 등에 대비한 대책
                    조직은 해킹이나 컴퓨터 바이러스 등에 의해 회원의 개인정보가 유출되거나 훼손되는 것을 막기 위해 최선을 다하고 있습니다.
                    개인정보의 훼손에 대비해서 자료를 수시로 백업하고 있고, 최신 백신프로그램을 이용하여 이용자들의 개인정보나 자료가 누출되거나 손상되지 않도록 방지하고 있으며, 암호화통신 등을 통하여 네트워크상에서 개인정보를 안전하게 전송할 수 있도록 하고 있습니다.
                    그리고 침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있으며, 기타 시스템적으로 보안성을 확보하기 위한 가능한 모든 기술적 장치를 갖추려 노력하고 있습니다.
                    다. 취급 직원의 최소화 및 교육
                    조직의 개인정보관련 취급 직원은 담당자에 한정시키고 있고 이를 위한 별도의 비밀번호를 부여하여 정기적으로 갱신하고 있으며, 담당자에 대한 수시 교육을 통하여 조직 개인정보취급방침의 준수를 항상 강조하고 있습니다.
                    단, 이용자 본인의 부주의나 인터넷상의 문제로 ID, 비밀번호, 등 개인정보가 유출되어 발생한 문제에 대해 조직은 일체의 책임을 지지 않습니다.
                    9. 고지의 의무
                    현 개인정보취급방침 내용 추가, 삭제 및 수정이 있을 시에는 개정 최소 7일전부터 홈페이지의 '공지사항'을 통해 고지할 것입니다.
                    10. 기타
                    사이트에 링크되어 있는 웹사이트들이 개인정보를 수집하는 행위에 대해서는 본 "개인정보취급방침"이 적용되지 않음을 알려 드립니다.
                  </p>
              </div>
              <input type="checkbox" class="checkbox-inner" v-model="second_agree" true-value="agree" false-value="disagree" name="check"  />
              <!--<label for="checkbox">{{ checked }}</label>-->
              <label for="exampleInputEmail1">개인정보 수집 및 이용에 대한 안내에 동의합니다.</label>
            </section>
            <span class="text-muted"></span>
          </div>
          <div class="d-flex">
            <router-link to="/" class="btn btn-secondary btn-block"><b>취소</b></router-link>
            <router-link to="/joininfo" class="btn btn-primary btn-block ms-2"><b>다음</b></router-link>
          </div>
        </form>
        
      </div>
    </main>
  </div>
</template>

<script>
export default {
  name: "joinPage",
  data() {
    return{
      selectall: false,
      first_agree: false,
      second_agree: false,
    }
  },
  methods:{
    selectAll(selectAll)  {
      const checkboxes 
       = document.getElementsByName('check');
  
      checkboxes.forEach((checkbox) => {
        checkbox.checked = selectAll.checked;
      })
    }
  }
};
</script>


<style scoped lang="scss">
body {
  height: 100vh;
  margin: 0;
  padding: 0px;
  width: 100%;
}

a {
  text-decoration: none;
}

.callout {
  width: 340px;
  margin: 0 auto;
  padding: 16px;
  border: 1px solid;
  border-radius: 6px;
  border-color: $color-border;
  text-align: center;
}

.txt-btn {
  display: block;
  position: absolute;
  text-align: right;
  top: 434px;
  right: 550px;
}

.el-checkbox {
  display: flex;
  align-items: flex-start;
}

.form-header {
  text-align: center;
  // h3 > b {color: $color-secondary-orange;}
}

.form {
  width: 544px;
  margin: 0 auto;
  padding: 16px;
  border: 1px solid;
  border-radius: 6px;
  border-color: $color-border;
}

.form label {
  margin-bottom: 8px;
}

.form input {
  margin-top: 4px;
  margin-bottom: 16px;
}

.btn-primary {
  background-color: $color-primiary-blue;
  border-color: $color-border;
}

.btn-secondary {
  color: black;
  background-color: $color-background;
  border-color: $color-border;
}

.btn-block {
  display: block;
  width: 100%;
}

.checkbox-inner {
  width: 16px;
  height: 16px;
  margin: 0 8px 0 0;
  border-radius: 4px;
}
.group {
  // margin: 30px 0 0 0;
  padding: 25px;
  border-radius: 10px;
  background-color: #f7f8fc;
}
.group-scroll {
  overflow: auto;
  height: 150px;
  margin: 15px 0;
  padding: 30px;
  border-radius: 10px;
  background-color: #e2e6ed;
}

p {
  display: block;
}
</style>